huaweiwx/ARDUINO_EFM32/hardware/arm/EFM32/boards.txt
# EFM32 Boards
menu.device_variant=Variant
menu.osc=OSC Speed
menu.cpu_speed=CPU Speed(MHz)
menu.serial=Serial communication
menu.bootloader_version=Bootloader version
menu.upload_method=Upload method
menu.log=Debug Log_level

########################    EFM32G222Fx    ###########################
EFM32G222.name=EFM32G222Fx

EFM32G222.build.core=arduino
EFM32G222.build.series=EFM32G
EFM32G222.build.variant=efm32g222f
EFM32G222.build.board=efm32g222f128
EFM32G222.build.mcu=-mthumb -mcpu=cortex-m3

EFM32G222.menu.device_variant.128=EFM32G222F128
EFM32G222.menu.device_variant.128.build.board=efm32g222f128
EFM32G222.menu.device_variant.128.build.cpu_flags=-DARM_MATH_CM3 -DEFM32G222F128
EFM32G222.menu.device_variant.128.build.ldscript=ld/efm32g222f128.ld
EFM32G222.menu.device_variant.128.upload.maximum_size=131072
EFM32G222.menu.device_variant.128.upload.maximum_data_size=16384

EFM32G222.menu.device_variant.64=EFM32G222F64
EFM32G222.menu.device_variant.64.build.board=efm32g222f64
EFM32G222.menu.device_variant.64.build.cpu_flags=-DARM_MATH_CM3 -DEFM32G222F64
EFM32G222.menu.device_variant.64.build.ldscript=ld/efm32g222f64.ld
EFM32G222.menu.device_variant.64.upload.maximum_size=65536
EFM32G222.menu.device_variant.64.upload.maximum_data_size=16384

EFM32G222.menu.device_variant.32=EFM32G222F32
EFM32G222.menu.device_variant.32.build.board=efm32g222f32
EFM32G222.menu.device_variant.32.build.cpu_flags=-DARM_MATH_CM3 -DEFM32G222F32
EFM32G222.menu.device_variant.32.build.ldscript=ld/efm32g222f32.ld
EFM32G222.menu.device_variant.32.upload.maximum_size=32768
EFM32G222.menu.device_variant.32.upload.maximum_data_size=8192


EFM32G222.build.f_cpu=32000000L
EFM32G222.menu.osc.hfrc=HFRCO (28MHz)
EFM32G222.menu.osc.hfrc.build.osc=14000000L  -DUSE_HFRCO
EFM32G222.menu.osc.hfrc.build.f_cpu=28000000L
EFM32G222.menu.osc.lfrc=LFRCO
EFM32G222.menu.osc.lfrc.build.osc=32768L -DUSE_LFRCO
EFM32G222.menu.osc.hfxo=HFXO (32M)
EFM32G222.menu.osc.hfxO.build.osc=32000000L -DUSE_HFXO
EFM32G222.menu.osc.Lfxo=LFXO
EFM32G222.menu.osc.LfxO.build.osc=32768L -DUSE_LFXO

EFM32G222.menu.serial.serial1=USART0(PE10/11) 
EFM32G222.menu.serial.serial1.build.extra_flags_serial=-DMENU_SERIAL=Serial1
EFM32G222.menu.serial.serial2=USART1(PC0/1)
EFM32G222.menu.serial.serial2.build.extra_flags_serial=-DMENU_SERIAL=Serial2
EFM32G222.menu.serial.leserial=LEUART0(9600bps only PD4/5)
EFM32G222.menu.serial.leserial.build.extra_flags_serial=-DMENU_SERIAL=LESerial0

EFM32G222.build.vect=VECT_TAB_OFFSET=0x0000000
EFM32G222.build.runin=FLASH
EFM32G222.build.uploadadr=0x00000000

#-------------------------------------- DEBUG & LOGLEVEL ---------------------------------------#
EFM32G222.menu.log.default=Release(no-exceptions)
EFM32G222.menu.log.default.build.log_level=-fno-exceptions
EFM32G222.menu.log.Release=Release(exceptions)
EFM32G222.menu.log.fatal=FATAL
EFM32G222.menu.log.fatal.build.log_level=-D__LOG_LEVEL=1 -DUSE_FULL_ASSERT
EFM32G222.menu.log.error=ERROR
EFM32G222.menu.log.error.build.log_level=-D__LOG_LEVEL=2 -DUSE_FULL_ASSERT
EFM32G222.menu.log.warning=WARNING
EFM32G222.menu.log.warning.build.log_level=-D__LOG_LEVEL=3 -DUSE_FULL_ASSERT
EFM32G222.menu.log.info=INFO
EFM32G222.menu.log.info.build.log_level=-D__LOG_LEVEL=4 -DUSE_FULL_ASSERT
EFM32G222.menu.log.debug=DEBUG
EFM32G222.menu.log.debug.build.log_level=-D__LOG_LEVEL=5 -DUSE_FULL_ASSERT
EFM32G222.menu.log.trace=TRACE
EFM32G222.menu.log.trace.build.log_level=-D__LOG_LEVEL=6 -DUSE_FULL_ASSERT

EFM32G222.upload.file_type=bin
EFM32G222.upload.params.quiet=no
EFM32G222.upload.use_1200bps_touch=false
#--------------------------UPLOAD METHODS------------------------------
EFM32G222.upload.auto_reset=fauls

# Upload choices
EFM32G222.menu.upload_method.jLinkMethod=JLink
EFM32G222.menu.upload_method.jLinkMethod.upload.tool=jlink_upload
EFM32G222.menu.upload_method.jLinkMethod.upload.protocol=jlink
EFM32G222.menu.upload_method.jLinkMethod.upload.device=EFM32G222F128

EFM32G222.menu.upload_method.serialMethod=Serial
EFM32G222.menu.upload_method.serialMethod.upload.protocol=maple_serial
EFM32G222.menu.upload_method.serialMethod.upload.tool=serial_upload


########################    EFM32TG110Fx    ###########################
EFM32TG110.name=EFM32TG110Fx

EFM32TG110.build.core=arduino
EFM32TG110.build.series=EFM32TG
EFM32TG110.build.variant=efm32Tg110
EFM32TG110.build.board=efm32Tg110f32
EFM32TG110.build.mcu=-mthumb -mcpu=cortex-m3

EFM32TG110.menu.device_variant.32=EFM32TG110F32
EFM32TG110.menu.device_variant.32.build.board=efm32tg110f32
EFM32TG110.menu.device_variant.32.build.cpu_flags=-DARM_MATH_CM3 -DEFM32TG110F32
EFM32TG110.menu.device_variant.32.build.ldscript=ld/efm32tg110f32.ld
EFM32TG110.menu.device_variant.32.upload.maximum_size=32768
EFM32TG110.menu.device_variant.32.upload.maximum_data_size=4096

EFM32TG110.menu.device_variant.16=EFM32TG110F16
EFM32TG110.menu.device_variant.16.build.board=efm32tg110f16
EFM32TG110.menu.device_variant.16.build.cpu_flags=-DARM_MATH_CM3 -DEFM32TG110F16
EFM32TG110.menu.device_variant.16.build.ldscript=ld/efm32tg110f16.ld
EFM32TG110.menu.device_variant.16.upload.maximum_size=16384
EFM32TG110.menu.device_variant.16.upload.maximum_data_size=4096

EFM32TG110.build.f_cpu=32000000L
EFM32TG110.menu.osc.hfrc=HFRCO (28MHz)
EFM32TG110.menu.osc.hfrc.build.osc=14000000L  -DUSE_HFRCO
EFM32TG110.menu.osc.hfrc.build.f_cpu=28000000L
EFM32TG110.menu.osc.lfrc=LFRCO
EFM32TG110.menu.osc.lfrc.build.osc=32768L -DUSE_LFRCO
EFM32TG110.menu.osc.hfxo=HFXO 32M
EFM32TG110.menu.osc.hfxO.build.osc=3200000L -DUSE_HFXO
EFM32TG110.menu.osc.Lfxo=LFXO
EFM32TG110.menu.osc.LfxO.build.osc=32768L -DUSE_LFXO

EFM32TG110.menu.serial.serial1=USART0(PE10/11) 
EFM32TG110.menu.serial.serial1.build.extra_flags_serial=-DMENU_SERIAL=Serial1
EFM32TG110.menu.serial.serial2=USART1(PD0/1)
EFM32TG110.menu.serial.serial2.build.extra_flags_serial=-DMENU_SERIAL=Serial2
EFM32TG110.menu.serial.leserial=LEUART0(9600bps only PD4/5)
EFM32TG110.menu.serial.leserial.build.extra_flags_serial=-DMENU_SERIAL=LESerial0

EFM32TG110.build.vect=VECT_TAB_OFFSET=0x0000000
EFM32TG110.build.runin=FLASH
EFM32TG110.build.uploadadr=0x00000000

#--------------------------UPLOAD METHODS------------------------------
EFM32TG110.upload.file_type=bin
EFM32TG110.upload.params.quiet=no
EFM32TG110.upload.use_1200bps_touch=false
EFM32TG110.upload.auto_reset=fauls

# Upload choices
EFM32TG110.menu.upload_method.jLinkMethod=JLink
EFM32TG110.menu.upload_method.jLinkMethod.upload.tool=jlink_upload
EFM32TG110.menu.upload_method.jLinkMethod.upload.protocol=jlink
EFM32TG110.menu.upload_method.jLinkMethod.upload.device=EFM32G222F128

EFM32TG110.menu.upload_method.serialMethod=Serial
EFM32TG110.menu.upload_method.serialMethod.upload.protocol=maple_serial
EFM32TG110.menu.upload_method.serialMethod.upload.tool=serial_upload

################################################################